// Напишите программу, которая принимает на вход координаты точки (X и Y),
// причём X ≠ 0 или Y ≠ 0 и выдаёт номер четверти плоскости,
// в которой находится эта точка.

int Prompt(string message)
{
    System.Console.Write(message);           // Вывести сообщение
    string readValue = Console.ReadLine();   // Считывает с консоли строку
    int result = int.Parse(readValue);       // Преобразует строку в целое число
    return result;                           // Возвращает результат функции
}

int x = Prompt("Введите X -> ");
int y = Prompt("Введите Y -> ");

if (x == 0 или y == 0)

int quaretr;
if (x > 0 && y > 0)
{
    quaretr = 1;
}
int quaretr;
if (x > 0 && y > 0)
{
    quaretr = 1;
}
int quaretr;
if (x > 0 && y > 0)
{
    quaretr = 1;
}
int quaretr;
if (x > 0 && y > 0)
{
    quaretr = 1;
}
System.Console.WriteLine(quaretr);